import json
import os

import pytest

from src.services import get_cashback


@pytest.mark.parametrize(
    "file, year, month, expected",
    [
        (
            "operations.xls",
            2019,
            2,
            {
                "Образование": 4582.0,
                "Супермаркеты": 269.0,
                "Другое": 182.0,
                "Связь": 156.0,
                "Ж/д билеты": 142.0,
                "Аптеки": 108.0,
                "Фастфуд": 77.0,
                "Наличные": 50.0,
                "Одежда и обувь": 45.0,
                "Транспорт": 40.0,
                "Различные товары": 15.0,
                "Рестораны": 12.0,
                "Переводы": 5.0,
                "НКО": 4.0,
                "Искусство": 3.0,
                "Красота": 2.0,
                "Бонусы": 0.0,
                "Пополнения": 0.0,
                "Дом и ремонт": 0.0,
            },
        ),
        (
            "operations.xls",
            2020,
            3,
            {
                "Супермаркеты": 260.0,
                "Аптеки": 133.0,
                "Другое": 100.0,
                "Фастфуд": 23.0,
                "Дом и ремонт": 20.0,
                "НКО": 15.0,
                "Транспорт": 15.0,
                "Различные товары": 11.0,
                "Связь": 6.0,
                "Сервис": 5.0,
                "Наличные": 3.0,
                "Образование": 2.0,
                "Рестораны": 2.0,
                "Одежда и обувь": 0.0,
                "Переводы": 0.0,
                "Цветы": 0.0,
            },
        ),
        (
            "operations.xls",
            2021,
            5,
            {
                "Отели": 441.0,
                "Наличные": 390.0,
                "Турагентства": 286.0,
                "Супермаркеты": 278.0,
                "Ж/д билеты": 165.0,
                "Транспорт": 122.0,
                "Аптеки": 88.0,
                "Фастфуд": 76.0,
                "Госуслуги": 76.0,
                "Переводы": 40.0,
                "Различные товары": 40.0,
                "Дом и ремонт": 32.0,
                "Красота": 6.0,
                "Связь": 6.0,
                "Сувениры": 4.0,
                "Рестораны": 2.0,
                "Книги": 2.0,
                "Бонусы": 0.0,
                "Сервис": 0.0,
                "Пополнения": 0.0,
            },
        ),
    ],
)
def test_get_cashback(file, year, month, expected):
    filename = "cashback.json"
    if os.path.exists(filename):
        os.remove(filename)
    assert get_cashback(file, year, month) == expected
    with open("cashback.json") as f:
        data = json.load(f)
    assert data == expected
